-- Курсовая работы по предмету СУБД MySQL

-- Тема: "База данных цеха изготовления деталей"

drop database if exists workshop;
create database workshop;
use workshop;

-- 1. Создание таблицы areas (участки - структурные подразделения цеха)
drop table if exists areas;
create table areas(
	id serial primary key COMMENT 'НОМЕР УЧАСТКА', -- Номер участка (BIGINT unsigned not null auto_increment unique)
	description varchar(255), -- Описание работы участка
	location int unsigned not null COMMENT 'ЭТАЖ' -- Расположение участка (этаж)
	-- head_master varchar(255) -- Старший мастер участка
);



-- 2. Создание таблицы employees (все относящиеся к цеху работники) 
drop table if exists employees;
create table employees(
	id serial primary key, -- Номер работника (BIGINT unsigned not null auto_increment unique)
	firstname varchar(100),
	lastname varchar(100),
	area_id BIGINT unsigned not null COMMENT 'ПРИНАДЛЕЖНОСТЬ К ОПРЕДЕЛЕННОМУ УЧАСТКУ',
	position varchar(100) COMMENT 'ДОЛЖНОСТЬ',
	hiring year, -- Год приема на работу
	age int unsigned not null,
	special_status varchar(100), -- Осообый статус работника (молодой специалист, ветеран)
	foreign key(area_id) references areas(id) on update cascade on delete cascade
);


-- 3. Создание таблицы equipment (оборудование, находящееся в цехе)
drop table if exists equipment;
create table equipment(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	title varchar(100) COMMENT 'НАЗВАНИЕ ОБОРУДОВАНИЯ С МОДЕЛЬЮ',
	purpose varchar(255) COMMENT 'ОСНОВНОЕ НАЗНАЧЕНИЕ ОБОРУДОВАНИЯ',
	type_equipment ENUM('токарный', 'фрезерный', 'шлифовальный', 'резьбонарезной', 'слесарный', 'прочее'),
	cnc bool COMMENT 'НАЛИЧИЕ СИСТЕМЫ ЧПУ НА СТАНКЕ',
	area_id BIGINT unsigned not null COMMENT 'ПРИНАДЛЕЖНОСТЬ К ОПРЕДЕЛЕННОМУ УЧАСТКУ',
	operator_id BIGINT unsigned not null COMMENT 'ОПЕРАТОР СТАНКА',
	`status` ENUM('in work', 'downtime', 'on repair'), -- downtime - подразумевается простой, когда нет работы
	maintainance_date date COMMENT 'ДАТА ПОСЛЕДНЕГО ТЕХНИЧЕСКОГО ОБСЛУЖИВАНИЯ СТАНКА',
	foreign key(area_id) references areas(id) on update cascade on delete cascade,
	foreign key(operator_id) references employees(id) on update cascade on delete cascade
);

-- Создание таблицы tools_pantry (инструментальные кладовые в цехе)
drop table if exists tools_pantry;
create table tools_pantry(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	description varchar(255) COMMENT 'ОПИСАНИЕ ИНСТРУМЕНТАЛЬНОЙ КЛАДОВОЙ'
);

-- 4. Создание таблицы tools (инструмент в цехе и его нахождение в инструментальных кладовых)
drop table if exists tools;
create table tools(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	tool varchar(255) COMMENT 'НАЗВАНИЕ ИНСТРУМЕНТА',
	type_tool ENUM('токарный', 'фрезерный', 'шлифовальный', 'резьбонарезной', 'слесарный', 'прочее'),
	balance int unsigned COMMENT 'ДОСТУПНОЕ КОЛИЧЕСТВО',
	tool_pantry_id bigint unsigned not null COMMENT 'НОМЕР ИНСТРУМЕНТАЛЬНОЙ КЛАДОВОЙ, ГДЕ НАХОДИТСЯ ИНСТРУМЕНТ',
	foreign key (tool_pantry_id) references tools_pantry(id) on update cascade on delete cascade
);


-- Связь М-М с таблицей areas делаем через вспомогательную таблицу tools_areas
-- Один инструмент может быть выдан любом участку и любой участок может получить один инструмент
drop table if exists tools_areas;
create table tools_areas(
	tool_id BIGINT unsigned not null,
	area_id BIGINT unsigned not null,
	primary key (tool_id, area_id), -- составной
	foreign key (tool_id) references tools_pantry(id) on update cascade on delete cascade,
	foreign key (area_id) references areas(id) on update cascade on delete cascade
);	


-- 5. Создание таблицы details (детали, обрабатываемые в цехе)
drop table if exists details;
create table details(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	part_number int, -- шифр детали
	title varchar(255) COMMENT 'НАЗВАНИЕ ДЕТАЛИ',
	difficult tinyint COMMENT 'ГРУППА СЛОЖНОСТИ ДЕТАЛИ', -- чем больше цифра, тем деталь сложнее в обработке
	area_id BIGINT unsigned not null COMMENT 'ПРИНАДЛЕЖНОСТЬ К ОПРЕДЕЛЕННОМУ УЧАСТКУ',
	quantity int unsigned COMMENT 'КОЛИЧЕСТВО ДЕТАЛЕЙ В ОБРАБОТКЕ',
	foreign key(area_id) references areas(id) on update cascade on delete cascade
);



-- 6. Создание таблицы weekly_basis (недельное задание на изготовление деталей)
drop table if exists weekly_basis;
create table weekly_basis(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	part_number_id BIGINT unsigned not null,
	term date COMMENT 'СРОК НА ИЗГОТОВЛЕНИЕ',
	foreign key(part_number_id) references details(id) on update cascade on delete cascade
);



-- 7. Создание таблицы control (бюро технического контроля цехов)
drop table if exists control;
create table control(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	description varchar(255),
	area_id BIGINT unsigned not null COMMENT 'ПРИНАДЛЕЖНОСТЬ К ОПРЕДЕЛЕННОМУ УЧАСТКУ',
	head_controller varchar(255), -- Старший контролер БТК
	foreign key control(area_id) references areas(id) on update cascade on delete cascade
);



-- 8. Создание таблицы repair (журнал ремонта оборудования)
drop table if exists repair;
create table repair(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	equipment_id BIGINT unsigned not null COMMENT 'НОМЕР ОБОРУДОВАНИЯ',
	description varchar(255) COMMENT 'ОПИСАНИЕ ПОЛОМКИ ОБОРУДОВАНИЯ',
	date_of_breakdown date COMMENT 'ДАТА ВЫХОДА ИЗ СТРОЯ',
	date_of_repair date COMMENT 'ДАТА ВВОДА В РАБОТУ',
	foreign key(equipment_id) references equipment(id) on update cascade on delete cascade
);



-- 9. Создание таблицы rests (ежегодные отпуска работников)
drop table if exists rests;
create table rests(
	employee_id serial primary key, -- BIGINT unsigned not null auto_increment unique
	start_rest date COMMENT 'ДАТА НАЧАЛА ОТПУСКА',
	finish_rest date COMMENT 'ДАТА ОКОНЧАНИЯ ОТПУСКА',
	foreign key(employee_id) references employees(id) on update cascade on delete cascade
);



-- 10. Создание таблицы defective (описание перечня забракованых деталей и причин)
drop table if exists defective;
create table defective(
	id serial primary key, -- BIGINT unsigned not null auto_increment unique
	detail_id BIGINT unsigned not null COMMENT 'ШИФР ДЕТАЛИ',
	description varchar(255) COMMENT 'ОПИСАНИЕ ПРИЧИН БРАКА',
	control_id BIGINT unsigned not null COMMENT 'БТК, ОБНАРУЖЕВШЕЕ БРАК',
	foreign key(detail_id) references details(id) on update cascade on delete cascade,
	foreign key(control_id) references control(id) on update cascade on delete cascade
);



________________________________________________________________
-- Заполнение таблиц данными

-- Добавление данных в таблицу areas
insert ignore into areas (description, location)
values
	('Обработка крупногабаритных корпусных деталей', 1),
	('Обработка валов', 1),
	('Обработка дисков и крупных узловых деталей', 1),
	('Обработка малогабаритных деталей повышенной точности', 2),
	('Обработка метизов', 2),
	('Изготовление элементов оснастки', 2),
	('Лазерная обработка деталей', 3),
	('Упрочнение деталей дробеструйным методом', 2),
	('Обработка зубчатых колес', 1),
	('Опытный участок по отработке технологий', 1);

-- Добавление данных в таблицу employees
insert ignore into employees (firstname, lastname, area_id, position, hiring, age, special_status)
values
	('Иван', 'Корнилицын', 1, 'фрезеровщик', '2010', 55, null),
	('Дмитрий', 'Новиков', 1, 'фрезеровщик', '2015', 32, null),
	('Артем', 'Килин', 1, 'токарь', '2000', 48, null),
	('Сергей', 'Шутемов', 1, 'токарь', '2004', 40, null),
	('Игорь', 'Томилов', 1, 'распределитель', '2007', 35, null),
	('Максим', 'Быстров', 2, 'токарь', '2009', 33, null),
	('Иван', 'Фетров', 2, 'токарь-расточник', '2010', 39, null),
	('Владимир', 'Пашин', 2, 'токарь', '2018', 53, null),
	('Антон', 'Катаев', 2, 'токарь', '2019', 23, 'Молодой специалист'),
	('Тимофей', 'Сулимов', 2, 'слесарь', '2014', 28, null),
	('Андрей', 'Меркушев', 3, 'токарь-расточник', '2010', 55, null),
	('Дмитрий', 'Мартыненко', 3, 'токарь', '2012', 32, null),
	('Иван', 'Логинов', 3, 'фрезеровщик', '2000', 48, null),
	('Сергей', 'Моисеев', 3, 'шлифовщик', '1985', 62, 'Пенсионер'),
	('Игорь', 'Исаев', 3, 'шлифовщик', '2007', 35, null),
	('Максим', 'Юдин', 4, 'токарь', '2008', 34, null),
	('Святослав', 'Тихонов', 4, 'токарь', '2005', 39, null),
	('Владимир', 'Зуев', 4, 'токарь', '2015', 50, null),
	('Антон', 'Лапин', 4, 'токарь', '1980', 67, 'Пенсионер'),
	('Юрий', 'Емельянов', 4, 'слесарь', '2013', 30, null),
	('Иван', 'Большаков', 5, 'слесарь', '2012', 55, null),
	('Роман', 'Веселов', 5, 'токарь', '2017', 32, null),
	('Артем', 'Калинин', 5, 'токарь', '2019', 48, null),
	('Николай', 'Матвеев', 5, 'токарь', '2004', 40, null),
	('Игорь', 'Егоров', 5, 'шлифовщик', '2008', 35, null),
	('Владимир', 'Белоусов', 6, 'фрезеровщик', '2007', 33, null),
	('Иван', 'Журавлев', 6, 'фрезеровщик', '2010', 39, null),
	('Арсений', 'Фролов', 6, 'фрезеровщик', '2017', 53, null),
	('Антон', 'Карпов', 6, 'шлифовщик', '2020', 23, 'Молодой специалист'),
	('Георгий', 'Рябов', 6, 'слесарь', '2015', 29, null),
	('Иван', 'Соболев', 7, 'оператор лазерной установки', '2011', 39, null),
	('Дмитрий', 'Колеников', 7, 'оператор лазерной установки', '2016', 33, null),
	('Юрий', 'Ширяев', 7, 'оператор лазерной установки', '2001', 50, null),
	('Сергей', 'Миронов', 7, 'слесарь', '2005', 41, null),
	('Владислав', 'Суханов', 7, 'распределитель', '2008', 35, null),
	('Максим', 'Кузнецов', 8, 'слесарь', '2009', 33, null),
	('Иван', 'Попов', 8, 'слесарь', '2012', 39, null),
	('Григорий', 'Соколов', 8, 'слесарь', '2017', 53, null),
	('Антон', 'Павлов', 8, 'оператор', '2019', 23, 'Молодой специалист'),
	('Тимофей', 'Конкин', 8, 'слесарь', '2015', 28, null),
	('Никита', 'Комаров', 9, 'фрезеровщик', '2010', 55, null),
	('Дмитрий', 'Орлов', 9, 'фрезеровщик', '2015', 32, null),
	('Артем', 'Анисимов', 9, 'доводчик', '2000', 48, null),
	('Илья', 'Петухов', 9, 'доводчик', '2004', 40, null),
	('Игорь', 'Федотов', 9, 'слесарь', '2007', 35, null),
	('Григорий', 'Титов', 10, 'токарь', '2009', 33, null),
	('Иван', 'Гусев', 10, 'токарь-расточник', '2010', 39, null),
	('Владимир', 'Осипов', 10, 'фрезеровщик', '2018', 53, null),
	('Антон', 'Смирнов', 10, 'шлифовщик', '2021', 22, 'Молодой специалист'),
	('Александр', 'Жуков', 10, 'слесарь', '2015', 27, null);


-- Добавление данных в таблицу equipment
insert ignore into equipment (title, purpose, type_equipment, cnc, area_id, operator_id, `status`, maintainance_date)
values
	('65А90Ф1', 'черновое фрезерование заготовок', 'фрезерный', 0, 1, 1, 'in work', '2020-10-10'),
	('66К12ПМФ4', 'чистовое фрезерование заготовок', 'фрезерный', 1, 1, 2, 'in work', '2021-07-11'),
	('16К20', 'черновое точение заготовок', 'токарный', 0, 1, 3, 'in work', '2020-01-10'),
	('Smart-Turn N150', 'чистовое точение заготовок', 'токарный', 1, 1, 4, 'in work', '2020-02-11'),
	('1К62', 'черновое точение заготовок', 'токарный', 0, 2, 6, 'in work', '2020-03-15'),
	('16Т20', 'черновое точение заготовок', 'токарный', 0, 2, 7, 'in work', '2020-11-11'),
	('Nakamura WT-100', 'чистовое точение заготовок', 'токарный', 1, 2, 8, 'on repair', '2020-12-14'),
	('Nakamura WT-100', 'чистовое точение заготовок', 'токарный', 1, 2, 9, 'in work', '2019-08-10'),
	('16К20', 'черновое точение заготовок', 'токарный', 0, 3, 11, 'in work', '2021-11-10'),
	('16К20П', 'чистовое точение заготовок', 'токарный', 0, 3, 12, 'downtime', '2020-12-08'),
	('66К16Ф4', 'чистовое фрезерование заготовок', 'фрезерный', 1, 3, 13, 'in work', '2020-10-07'),
	('2550АН', 'плоское шлифование заготовок', 'шлифовальный', 0, 3, 14, 'on repair', '2021-10-06'),
	('2В423', 'круглое шлифование заготовок', 'шлифовальный', 0, 3, 15, 'in work', '2019-05-10'),
	('1К62', 'черновое точение заготовок', 'токарный', 0, 4, 16, 'in work', '2021-10-12'),
	('1К62', 'черновое точение заготовок', 'токарный', 0, 4, 17, 'in work', '2021-07-07'),
	('Doosan Puma MX2100', 'чистовое точение заготовок', 'токарный', 1, 4, 18, 'in work', '2020-08-19'),
	('Doosan Puma MX2100', 'чистовое точение заготовок', 'токарный', 1, 4, 19, 'in work', '2020-01-20'),
	('1А365', 'точение заготовок', 'токарный', 0, 5, 22, 'in work', '2020-12-28'),
	('16К20', 'черновое точение заготовок', 'токарный', 0, 5, 23, 'in work', '2020-02-28'),
	('1А525Ф3', 'точение заготовок', 'токарный', 0, 5, 24, 'in work', '2020-03-15'),
	('3474КВ', 'безцентровое шлифование заготовок', 'шлифовальный', 0, 5, 25, 'in work', '2020-04-10'),
	('6718', 'чистовое фрезерование заготовок', 'фрезерный', 1, 6, 26, 'in work', '2020-05-31'),
	('6720В', 'черновое фрезерование заготовок', 'фрезерный', 0, 6, 27, 'in work', '2020-06-06'),
	('675П-1', 'черновое фрезерование заготовок', 'фрезерный', 0, 6, 28, 'in work', '2020-07-11'),
	('3484ГВ', 'внутреннее круглое шлифование заготовок', 'шлифовальный', 0, 6, 29, 'in work', '2020-08-10'),
	('Trumpf Compact', 'лазерная резка', 'прочее', 1, 7, 31, 'in work', '2020-09-28'),
	('Trumpf 4030', 'лазерная резка', 'прочее', 1, 7, 32, 'in work', '2020-09-29'),
	('Trumpf 7020', 'лазерная резка', 'прочее', 1, 7, 33, 'on repair', '2021-08-10'),
	('Bremor', 'дробеструйная обработка', 'слесарный', 0, 8, 39, 'in work', '2020-12-22'),
	('67К16П', 'фрезерование заготовок', 'фрезерный', 0, 9, 41, 'in work', '2020-11-30'),
	('6904ВФ2', 'чистовое фрезерование заготовок', 'фрезерный', 1, 9, 42, 'in work', '2020-09-20'),
	('16К20', 'черновое точение заготовок', 'токарный', 0, 10, 46, 'downtime', '2020-08-07'),
	('1К62П', 'чистовое точение заготовок', 'токарный', 0, 10, 47, 'in work', '2020-12-01'),
	('67К25ПФ2-0', 'фрезерование заготовок', 'фрезерный', 0, 10, 48, 'in work', '2020-09-01'),
	('3Г71М', 'плоское шлифование заготовок', 'шлифовальный', 0, 10, 49, 'in work', '2021-07-10');

-- Добавление данных в таблицу tools_pantry
insert ignore into tools_pantry (description)
values
	('Лезвийный инструмент'),
	('Абразивный инструмент и прочее');

-- Добавление данных в таблицу tools
insert ignore into tools (tool, type_tool, balance, tool_pantry_id)
values
	('CNMG120408', 'токарный', 200, 1),
	('CNMG120408', 'токарный', 200, 1),
	('VNGG160404', 'токарный', 500, 1),
	('R245-12 T3 E-ML', 'фрезерный', 50, 1),
	('PNMA110408', 'фрезерный', 30, 1),
	('2ER VTX', 'резьбонарезной', 100, 1),
	('200х20х32 63C60K-L V', 'шлифовальный', 5, 2),
	('500х203х50 51K42', 'шлифовальный', 5, 2),
	('127х100х30 25A60L 6V2', 'шлифовальный', 1, 2),
	('25х32х6 25A40', 'слесарный', 200, 2),
	('Дробь свинцовая С1 №11 ф50', 'прочее', 200, 2);
	

-- Добавление данных в таблицу tools_areas
insert ignore into tools_areas (tool_id, area_id)
values
	(1, 1),
	(1, 2),
	(1, 3),
	(1, 4),
	(1, 5),
	(1, 6),
	(1, 7),
	(1, 8),
	(1, 9),
	(1, 10),
	(2, 1),
	(2, 2),
	(2, 3),
	(2, 4),
	(2, 5),
	(2, 6),
	(2, 7),
	(2, 8),
	(2, 9),
	(2, 10);

-- Добавление данных в таблицу details
insert ignore into details (part_number, title, difficult, area_id, quantity)
values
	(83288001, 'корпус', 4, 1, 2),
	(54288001, 'крышка', 3, 1, 10),
	(83288110, 'вал турбинный', 5, 2, 1),
	(83288001, 'вал промежуточный', 2, 2, 10),
	(45899871, 'диск покрывной', 4, 3, 2),
	(83277595, 'диск пятой ступени', 3, 3, 15),
	(11220145, 'втулка', 4, 4, 20),
	(11220557, 'ось', 2, 4, 50),
	(84015523, 'болт', 1, 5, 200),
	(84015525, 'гайка', 1, 5, 300),
	(78596632, 'ложемент', 3, 6, 5),
	(78595855, 'планшайба', 2, 6, 2),
	(23423222, 'лист', 1, 7, 1),
	(84015529, 'шайба пружинная', 1, 7, 100),
	(83254789, 'вал первичный', 3, 8, 1),
	(83254790, 'вал вторичный', 3, 8, 5),
	(33365874, 'колесо коническое ведущее 10', 5, 9, 10),
	(33365875, 'колесо коническое ведомое 43', 5, 9, 10),
	(10055896, 'патрубок', 4, 10, 1),
	(98966855, 'образец', 2, 10, 23);

-- Заполнение таблицы weekly_basis
insert ignore into weekly_basis (part_number_id, term)
values
	(1, '2021-12-28'),
	(2, '2022-01-28'),
	(3, '2022-01-15'),
	(4, '2022-01-12'),
	(5, '2021-12-15'),
	(6, '2022-02-01'),
	(7, '2022-02-05'),
	(8, '2022-02-10'),
	(9, '2022-02-15'),
	(10, '2022-03-01'),
	(11, '2022-01-20'),
	(12, '2022-01-15'),
	(13, '2022-01-28'),
	(14, '2022-01-19'),
	(15, '2022-04-20'),
	(16, '2022-05-20'),
	(17, '2022-03-01'),
	(18, '2022-03-07'),
	(19, '2022-03-30'),
	(20, '2022-01-28');

-- Заполнение таблицы weekly_basis
insert ignore into control (description, area_id, head_controller)
values
	('Контроль корпусных деталей', 1, 'Никитина'),
	('Контроль валов', 2, 'Югова'),
	('Контроль дисков', 3, 'Федосеева'),
	('Контроль малогабаритных деталей', 4, 'Пикулева'),
	('Контроль метизов', 5, 'Дорошенко'),
	('Контроль оснастки', 6, 'Авдеева'),
	('Контроль листовых деталей', 7, 'Маркова'),
	('Контроль упрочненных деталей', 8, 'Нигматуллина'),
	('Контроль зубчатых колес', 9, 'Абрамова'),
	('Общий контроль', 10, 'Шукшина');

-- Заполнение таблицы repair
insert ignore into `repair` (equipment_id, description, date_of_breakdown, date_of_repair)
values
	(1, 'течь насоса СОЖ', '2021-01-15', '2021-01-16'),
	(7, 'сбой системы ЧПУ', '2021-11-27', null),
	(12, 'засорение системы СОЖ', '2021-11-25', null),
	(15, 'износ направляющих', '2021-03-12', '2021-03-20'),
	(18, 'люфт подшипника шпинделя вне допуска', '2021-07-15', '2021-07-18'),
	(22, 'поломка рукоятки управления', '2021-02-15', '2021-02-16'),
	(24, 'разрыв приводного ремня', '2021-10-02', '2021-10-03'),
	(28, 'поломка фокусирующей трубки', '2021-11-25', null),
	(30, 'чрезмерное биение инструмента ввиду люфта хвостовика', '2021-05-15', '2021-05-25'),
	(30, 'выкрашивание зубьев главной передачи', '2021-07-04', '2021-07-12');

-- Заполнение таблицы rests
insert ignore into rests (employee_id, start_rest, finish_rest)
values
	(1, '2021-07-05', '2021-07-18'),
	(2, '2021-07-12', '2021-07-25'),
	(3, '2021-07-05', '2021-07-18'),
	(4, '2021-07-12', '2021-07-25'),
	(5, '2021-07-05', '2021-07-18'),
	(6, '2021-06-07', '2021-06-20'),
	(7, '2021-06-07', '2021-06-20'),
	(8, '2021-06-07', '2021-07-20'),
	(9, '2021-05-10', '2021-05-23'),
	(10, '2021-05-10', '2021-05-30'),
	(11, '2021-07-05', '2021-07-18'),
	(12, '2021-07-05', '2021-07-18'),
	(13, '2021-08-02', '2021-08-15'),
	(14, '2021-08-02', '2021-08-15'),
	(15, '2021-08-09', '2021-08-22'),
	(16, '2021-08-16', '2021-09-05'),
	(17, '2021-08-16', '2021-09-12'),
	(18, '2021-05-10', '2021-05-23'),
	(19, '2021-07-05', '2021-07-18'),
	(20, '2021-06-07', '2021-06-20'),
	(21, '2021-07-05', '2021-07-18'),
	(22, '2021-07-05', '2021-07-18'),
	(23, '2021-05-10', '2021-05-23'),
	(24, '2021-07-05', '2021-07-18'),
	(25, '2021-06-07', '2021-06-20'),
	(26, '2021-07-05', '2021-07-18'),
	(27, '2021-07-05', '2021-07-18'),
	(28, '2021-06-07', '2021-06-20'),
	(29, '2021-05-10', '2021-05-23'),
	(30, '2021-03-15', '2021-03-28'),
	(31, '2021-03-01', '2021-03-30'),
	(32, '2021-05-10', '2021-05-23'),
	(33, '2021-06-07', '2021-06-20'),
	(34, '2021-07-05', '2021-07-18'),
	(35, '2021-02-01', '2021-02-28'),
	(36, '2021-05-10', '2021-05-23'),
	(37, '2021-06-07', '2021-06-20'),
	(38, '2021-08-02', '2021-08-15'),
	(39, '2021-07-05', '2021-07-18'),
	(40, '2021-05-10', '2021-05-23'),
	(41, '2021-08-02', '2021-08-15'),
	(42, '2021-07-05', '2021-07-18'),
	(43, '2021-05-10', '2021-05-23'),
	(44, '2021-06-07', '2021-06-20'),
	(45, '2021-06-07', '2021-06-20'),
	(46, '2021-05-10', '2021-05-23'),
	(47, '2021-08-02', '2021-08-15'),
	(48, '2021-07-05', '2021-07-18'),
	(49, '2021-06-07', '2021-06-20'),
	(50, '2021-02-01', '2021-02-28');

-- Заполнение таблицы rests
insert ignore into defective (detail_id, description, control_id)
values
	(1, 'Зарез на чистовой поверхности', 1),
	(3, 'Провал чистового размера ф40', 2),
	(5, 'Наличие кольцевых рисок в чистовой зоне', 3),
	(6, 'Цвета побежалости на длине 50', 3),
	(8, 'Биение торца свыше 0.05', 4),
	(9, 'Отсутствие фаски в начале резьбы', 5),
	(12, 'Несоосность установочных отверстий', 6),
	(15, 'Отсутствие центровочного отверстия по поверхности А', 2),
	(18, 'Скол на головке зуба', 9),
	(19, 'Непроход калибра по внутреннему ф10', 10);


